Revit 2024 API
CompoundStructure.CanLayerBeStructuralMaterial Method
 Identifies if the input layer can be designated as defining the structural material for this structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool CanLayerBeStructuralMaterial(
	int layerIndex
)
Visual Basic
Public Function CanLayerBeStructuralMaterial ( _
	layerIndex As Integer _
) As Boolean
Visual C++
public:
bool CanLayerBeStructuralMaterial(
	int layerIndex
)
Parameters
layerIndex
Type: System.Int32
 Index of a layer in the CompoundStructure.
Return Value
 True if the input layer may be used to define the structural material and false otherwise.
Remarks
 Only core layers may be designated as defining the structural material.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace